CFD-framework/0/Umag
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    arch            "LSB;label=32;scalar=64";
    class           volScalarField;
    location        "0";
    object          Umag;
}

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform 413.097;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 413.097;
    }
    outlet
    {
        type            calculated;
        value           uniform 413.097;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    farSide
    {
        type            calculated;
        value           uniform 413.097;
    }
    bottom
    {
        type            calculated;
        value           uniform 413.097;
    }
    top
    {
        type            calculated;
        value           uniform 413.097;
    }
    c608
    {
        type            calculated;
        value           uniform 413.097;
    }
}


// ************************************************************************* //
