CFD-framework/0/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet       { type calculated; value uniform 0; }
    outlet      { type calculated; value uniform 0; }
    symmetry    { type symmetryPlane; }
    farSide     { type calculated; value uniform 0; }
    bottom      { type calculated; value uniform 0; }
    top         { type calculated; value uniform 0; }
    c608         { type compressible::alphatWallFunction; value uniform 0; }
}
