CFD-framework/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

kInf            0.256;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInf;

boundaryField
{
    inlet       { type fixedValue; value uniform $kInf; }
    outlet      { type zeroGradient; }
    symmetry    { type symmetryPlane; }
    farSide     { type fixedValue; value uniform $kInf; }
    bottom      { type fixedValue; value uniform $kInf; }
    top         { type fixedValue; value uniform $kInf; }
    c608         { type kqRWallFunction; value uniform $kInf; }
}
