CFD-framework/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    object          p;
}

pInf            10520;

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 10520;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 10520;
    }
    outlet
    {
        type            zeroGradient;
        value           uniform 10520;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    farSide
    {
        type            inletOutlet;
        value           uniform 10520;
        inletValue      uniform 10520;
    }
    bottom
    {
        type            inletOutlet;
        value           uniform 10520;
        inletValue      uniform 10520;
    }
    top
    {
        type            inletOutlet;
        value           uniform 10520;
        inletValue      uniform 10520;
    }
    c608
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
