CFD-framework/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    c608.stl
    {
        type triSurfaceMesh;
        name c608;
    }

    aircraftRefinement
    {
        type searchableBox;
        min (-1.5 -6.5 -2.2);
        max (31.0 0.0 3.4);
    }

    wakeRefinement
    {
        type searchableBox;
        min (22.0 -14.0 -4.0);
        max (70.0 0.0 4.0);
    }

    pressureLineRefinement
{
    type searchableCone;
    point1  (-1.5 0 0);
    radius1 0.5;
    point2  (40.0 -25.0 -25.0);   // aligned along ~45.6° Mach angle from aircraft
    radius2 20.0;
}
}

castellatedMeshControls
{
    maxLocalCells       2500000;
    maxGlobalCells      8000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.1;
    nCellsBetweenLevels 3;

    features
    (
        {
            file "c608.eMesh";
            level 2;
        }
    );

    refinementSurfaces
    {
        c608
        {
            level (2 3);
            patchInfo
            {
                type wall;
            }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        aircraftRefinement
        {
            mode inside;
            levels ((1E15 2));
        }

        wakeRefinement
        {
            mode inside;
            levels ((1E15 1));
        }

        pressureLineRefinement
        {
            mode inside;
            levels ((1E15 1));
        }
    }

    locationInMesh (14.3 -14.3 0.0);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch        3;
    tolerance           2.0;
    nSolveIter          60;
    nRelaxIter          5;
    nFeatureSnapIter    15;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;

    layers
    {
        c608
        {
            nSurfaceLayers 3;
        }
    }

    expansionRatio           1.2;
    finalLayerThickness      0.25;
    minThickness             0.05;
    nGrow                    0;
    featureAngle             60;
    slipFeatureAngle         30;
    nRelaxIter               5;
    nSmoothSurfaceNormals    1;
    nSmoothNormals           3;
    nSmoothThickness         10;
    maxFaceThicknessRatio    0.5;
    maxThicknessToMedialRatio 0.25;
    minMedialAxisAngle       90;
    nBufferCellsNoExtrude    0;
    nLayerIter               50;
    nRelaxedIter             20;
}

meshQualityControls
{
    maxNonOrtho             70;
    maxBoundarySkewness     20;
    maxInternalSkewness     4;
    maxConcave              80;
    minVol                  1e-13;
    minTetQuality           1e-15;
    minArea                 -1;
    minTwist                0.02;
    minDeterminant          0.001;
    minFaceWeight           0.02;
    minVolRatio             0.01;
    minTriangleTwist        -1;
    nSmoothScale            4;
    errorReduction          0.75;

    relaxed
    {
        maxNonOrtho 75;
    }
}

debug 0;
mergeTolerance 1e-6;
